Repository: 84000/data-translation-memory
Catalog: toh528-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་སྒྲོན་མ་མཆོག་གི་གཟུངས།
en: The Noble King of Spells The Dhāraṇī of Agrapradīpa

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། ལྷ་དང་མི་འབུམ་ཕྲག་དུ་མ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་དུ་མ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing near Śrāvastī, in Jeta Grove at Anāthapiṇḍada’s Park, along with a great congregation of 1,250 monks, many hundreds of thousands of gods and humans, and many hundreds of thousands of bodhisattvas.

source: ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏོ།
en: Surrounded and venerated by them, he taught the Dharma.

source: །སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་མཐའ་ཡས་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒྲོན་མ་མཆོག་ཅེས་བྱ་བ་ད་ལྟར་ཡང་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཆེན་པོ་དང་།
en: In a buddhafield one trillion buddhafields away from this buddhafield, the blessed, thus-gone, worthy, fully and perfectly awakened Buddha Agrapradīpa was residing in the world system named Infinite Flowers. He passed his time there teaching the Dharma.

source: འོད་དཔག་མེད་ཅེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་བཏང་ངོ་།
en: He sent the two great bodhisattvas, Great Light and Amitābha, here to the Sahā world system.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The two bodhisattvas went to Jeta Grove at Anāthapiṇḍada’s Park, where Śākyamuni, the blessed, thus-gone, worthy, fully and perfectly awakened Buddha was residing.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: They arrived, respectfully bowed their heads at the Blessed One’s feet, circumambulated him three times, and sat to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཉིས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་འབུམ་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་མཐའ་ཡས་ཞེས་བགྱི་བ་དེ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒྲོན་མ་མཆོག་ཅེས་བགྱི་བ་ད་ལྟར་བཞུགས་ཏེ།
en: Those two bodhisattvas said to the Blessed One, “Blessed One, a trillion buddhafields away is the world system named Infinite Flowers, where the blessed, thus-gone, worthy, fully and perfectly awakened Buddha Agrapradīpa resides.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: He passes his time there teaching the Dharma.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒྲོན་མའི་མཆོག་དེས་བདག་ཅག་གཉིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་བཏང་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒྲོན་མའི་མཆོག་དེས།
en: The blessed, thus-gone, worthy, fully and perfectly awakened Buddha Agrapradīpa sent us both here to this Sahā world system.

source: བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཆུང་ངམ།
en: The blessed, thus-gone, worthy, fully and perfectly awakened Buddha Agrapradīpa asks about the Blessed One’s health.

source: ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོའམ།
en: Are his illnesses and ailments few?

source: སྟོབས་དང་། བདེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་མ་མཆིས་པ་ལ་རེག་པར་གནས་སམ་ཞེས་སྙུན་གསོལ་ལོ། །འདི་སྐད་ཅེས་ཀྱང་གསུང་ངོ་། །འདི་ན་མིའམ། མི་མ་ལགས་པའམ། འབྱུང་པོའམ། ཤ་ཟའམ། གནོད་སྦྱིན་ནམ། སྲིན་པོའམ། གྲུལ་བུམ་མམ། གྲུལ་བུམ་གྱི་སྡེ་དཔོན་ནམ། རྒྱལ་པོའམ། བློན་པོ་ཆེན་པོའམ། ཆོམ་རྐུན་ནམ། སྦྲུལ་ལམ།
en: Is he fit, nourished, strong, happy, free of annoyances, and therefore comfortable? “

source: སྲིན་བུའམ། སྲིན་བུ་ལུ་ཏའམ། སྦྲང་བུ་ལྕགས་ཕྱེའམ། ཉེ་བའི་ཉོན་མོངས་པ་གང་ཡང་རུང་བདག་འཚེ་བར་བགྱིད་པ་འགའ་ཡང་མ་མཆིས་སམ་ཞེས་གསུང་ངོ་། །སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། མདངས་དང་ལྡན་པར་བགྱི་བ་དང་། གཟི་བརྗིད་དང་ལྡན་པར་བགྱི་བ་དང་། གྲགས་པ་དང་ལྡན་པར་བགྱི་བ་དང་། ཡོན་ཏན་དང་ལྡན་པར་བགྱི་བ་དང་།
en: He also asks if you are free from any and all of the harms in this world caused by humans, nonhumans, bhūtas, piśācas, yakṣas, rākṣasas, kumbhāṇḍas, the commander of the kumbhāṇḍa armies, kings, high-ranking ministers, thieves, snakes, insects, spiders, small biting insects, and other afflictions. “

source: སྟོབས་དང་ལྡན་པར་བགྱི་བ་དང་། མདོག་དང་ལྡན་པར་བགྱི་བ་དང་། བསྲུང་བ་དང་། སྦ་བ་དང་། བསྐྱབ་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒྲོན་མའི་མཆོག་དེས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཀྱང་བསྐུར་ཏེ། འདི་ལྟ་སྟེ། ཛྭཱ་ལེ་ཛྭཱ་ལེ། ཛྭཱ་ལེ་ག་ཏེ། ཧུཀྐུ། མུཀྐུ། སཾ་མ་ཏེ། མ་ཧཱ་སཾ་མ་ཏེ། མ་ཧཱ་ཛྭཱ་ལེ། ཛྭཱ་བ་ལ་མེ། ས་ཧེ་ས་ཧེ། མ་ཧཱ་ཛྭཱ་ལེ། ཨུཀྐེ། མུཀྐེ།
en: For the benefit, welfare, and happiness of all beings, to provide them with vitality, charisma, glory, good qualities, strength, and beauty, and to protect, guard, and preserve them, the blessed, thus-gone, worthy, fully and perfectly awakened Buddha Agrapradīpa offers this dhāraṇī-mantra formula: jvāle jvāle jvāle gate hukku mukku sammate mahāsammate mahājvāle jvāvala me sahe sahe mahājvāle ukke mukke śame sammahe mahāsammate mahāśame svāha.”

source: ཤ་མེ། སཾ་མ་ཧེ། མ་ཧཱ་སཾ་མ་ཧེ། མ་ཧཱ་ཤ་མེ་སྭཱ་ཧཱ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then addressed the venerable Ānanda: “Ānanda, remember this mantra formula.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཟུང་ཤིག །ལོང་ཤིག །ཆོང་ཤིག །
en: Receive it, retain it, recite it, and master it.

source: ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་ཅིག །
en: Teach it to others extensively.

source: ཀུན་དགའ་བོ་སངས་རྒྱས་འབྱུང་བ་རྙེད་པར་དཀའོ། །གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་རྙེད་པར་དཀའོ།
en: Ānanda, the appearance of a buddha is rare, and this dhāraṇī-mantra formula is hard to find.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་དག་འཛིན་པ་ཡང་ཤིན་ཏུ་རྙེད་པར་དཀའོ། །ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ནི་གཟུངས་ཀྱི་གསང་སྔགས་གཞི་འདི་དག་འཛིན་པ་དང་།
en: Ānanda, one who upholds this dhāraṇī-mantra formula is also exceedingly hard to find.

source: ལེན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་ནི་ཚེ་རབས་བདུན་དུ་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: Ānanda, any son or daughter of noble family who remembers, receives, retains, recites, and masters this dhāraṇī-mantra formula and teaches it to others extensively will remember their last seven rebirths.

source: །ཚེ་འདི་ཉིད་ལ་ཡང་སྔོན་གྱི་ལས་མ་གཏོགས་པར་གཞན་གྱི་གནོད་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བ་དང་། འགྲོ་བ་ཐམས་ཅད་དང་རྗེས་སུ་མཐུན་པར་འགྱུར་རོ།
en: In this life they will escape all harm apart from the results of their previous actions, and they will be in harmony with all beings.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ནི་སངས་རྒྱས་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་བདུན་གྱིས་གསུངས་ཏེ།
en: Ānanda, this dhāraṇī-mantra formula was taught by seventy-seven billion buddhas.

source: གང་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ལས་འདའ་བར་བྱེད་པ་དེ་ནི་དེ་དག་ཐམས་ཅད་ལ་འཁུས་པ་ཡིན་ནོ།
en: This dhāraṇī-mantra formula is hidden from all those who would violate it.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མ་ཕམ་པ་སྟན་ལས་ལངས་ཏེ། གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The bodhisattva mahāsattva Ajita then rose from his seat, adjusted his robe on his shoulder, and knelt down on his right knee.

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། མདངས་དང་ལྡན་པར་བགྱི་བ་དང་། གཟི་བརྗིད་དང་ལྡན་པར་བགྱི་བ་དང་། གྲགས་པ་དང་ལྡན་པར་བགྱི་བ་དང་། ཡོན་ཏན་དང་ལྡན་པར་བགྱི་བ་དང་། སྟོབས་དང་ལྡན་པར་བགྱི་བ་དང་། མདོག་དང་ལྡན་པར་བགྱི་བ་དང་། བསྲུང་བ་དང་། སྦ་བ་དང་། བསྐྱབ་པའི་སླད་དུ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་རྣམས་བརྗོད་པར་བགྱིའོ། །འདི་ལྟ་སྟེ། ཨཏྟེ། བཏྟེ། ནཏྟེ། ཀུ་ནཏྟེ། པུཀྐ་སེ། ཀུ་པུཀྐ་སེ། ཀ་སེ། ཨ་ན་ཀ་སེ། ནཱ་མ་ཀ་སེ། ཨ་ནུ་ཏ། པྲ་ནུ་ཏ། ཁ་ཛེ། མ་ཧཱ་ཁ་ཛེ།
en: Bowing to the Blessed One with joined palms, he spoke to the Blessed One: “O Blessed One, for the benefit, welfare, and happiness of all beings, to provide them with vitality, charisma, glory, good qualities, strength, and beauty, and to protect, guard, and preserve them, I will speak another dhāraṇī-mantra formula: atte vatte natte kunatte pukkase kupukkase kase anakase nāmakase anuta pranuta khaje mahākaje sadpaphe taḍaphe tuḍaphe hili mili tile svāha.”

source: སད་པ་ཕེ། ཏ་ཌ་ཕེ། ཏུ་ཌ་ཕེ། ཧི་ལི་མི་ལི་ཏི་ལེ་སྭཱ་ཧཱ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཟུང་ཤིག །
en: The Blessed One then addressed the venerable Ānanda: “Ānanda, remember this mantra formula.

source: ལོང་ཤིག །ཆོང་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: Receive it, retain it, recite it, and master it.

source: གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིག །
en: Teach it to others extensively.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འཛིན་པ་ཡང་ཤིན་ཏུ་རྙེད་པར་དཀའོ། །ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ།
en: Ānanda, one who upholds this dhāraṇī-mantra formula is also exceedingly hard to find.

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འཛིན་པ་དང་། ལེན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་ནི་ཚེ་རབས་བཅུ་གཉིས་སུ་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: Ānanda, any son or daughter of noble family who remembers, receives, retains, recites, and masters this dhāraṇī-mantra formula and teaches it to others extensively will remember their last twelve rebirths.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ནི་སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་གཉིས་ཀྱིས་གསུངས་ཏེ།
en: Ānanda, this dhāraṇī-mantra formula was taught by eighty-two billion buddhas.

source: །གང་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ལས་འདའ་བར་བྱེད་པ་ནི་དེ་དག་ཐམས་ཅད་ལ་འཁུས་པ་ཡིན་ནོ།
en: This dhāraṇī-mantra formula is hidden from all those who would violate it.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། མདངས་དང་ལྡན་པར་བགྱི་བ་དང་། གཟི་བརྗིད་དང་ལྡན་པར་བགྱི་བ་དང་། གྲགས་པ་དང་ལྡན་པར་བགྱི་བ་དང་། ཡོན་ཏན་དང་ལྡན་པར་བགྱི་བ་དང་།
en: Mañjuśrīkumārabhūta then rose from his seat, adjusted his robe on his shoulder, and knelt down on his right knee.

source: སྟོབས་དང་ལྡན་པར་བགྱི་བ་དང་། མདོག་དང་ལྡན་པར་བགྱི་བ་དང་། བསྲུང་བ་དང་། སྦ་བ་དང་། བསྐྱབ་པའི་སླད་དུ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་རྣམས་བརྗོད་པར་བགྱིའོ། །དེ་འདི་ལྟ་སྟེ། ཨཀྑེ། བཀྑེ། ན་ཛི་ཏེ། ནཱ་གཱ་ས་རེ།
en: Bowing to the Blessed One with joined palms, he spoke to the Blessed One: “O Blessed One, for the benefit, welfare, and happiness of all beings, to provide them with vitality, charisma, glory, good qualities, strength, and beauty, and to protect, guard, and preserve them, I will speak another dhāraṇī-mantra formula: akkhe vakkhe najite nāgāsare nahili jahile jahili vate caṇḍīla vate svāha.”

source: ན་ཧི་ལི། ཛ་ཧི་ལི། ཛ་ཧི་ལི་བ་ཏེ། ཙཎྜཱི་ལ་བ་ཏེ་སྭཱ་ཧཱ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཟུང་ཤིག །
en: The Blessed One then addressed the venerable Ānanda: “Ānanda, remember this mantra formula.

source: ལོང་ཤིག །ཆོང་ཤིག །ལྷོགས་ཤིག །
en: Receive it, retain it, recite it, and master it.

source: ཀུན་ཆུབ་པར་གྱིས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་ཅིག །
en: Teach it to others extensively.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འཛིན་པ་ཡང་ཤིན་ཏུ་རྙེད་པར་དཀའོ། །ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འཛིན་པ་དང་།
en: Ānanda, one who upholds this dhāraṇī-mantra formula is also exceedingly hard to find.

source: ལེན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་ནི་ཚེ་རབས་བཅུ་གསུམ་དུ་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: Ānanda, any son or daughter of noble family who remembers, receives, retains, recites, and masters this dhāraṇī-mantra formula and teaches it to others extensively will remember their last thirteen rebirths.

source: །ཚེ་འདི་ཉིད་ལ་ཡང་སྔོན་གྱི་ལས་མ་གཏོགས་པ་གཞན་གྱི་གནོད་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བ་དང་། འགྲོ་བ་ཐམས་ཅད་དང་རྗེས་སུ་མཐུན་པར་འགྱུར་རོ།
en: In this life they will escape all harm apart from the results of their previous actions, and they will be in harmony with all beings.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ངས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་། མདངས་དང་ལྡན་པར་བྱ་བ་དང་། གཟི་བརྗིད་དང་ལྡན་པར་བྱ་བ་དང་། གྲགས་པ་དང་ལྡན་པར་བྱ་བ་དང་། ཡོན་ཏན་དང་ལྡན་པར་བྱ་བ་དང་། སྟོབས་དང་ལྡན་པར་བྱ་བ་དང་། མདོག་དང་ལྡན་པར་བྱ་བ་དང་། བསྲུང་བ་དང་། སྦ་བ་དང་། བསྐྱབ་པའི་ཕྱིར་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་རྣམས་བཤད་དོ། །འདི་ལྟ་སྟེ། ཨཊྚེ། བཊྚེ། ན་ཊྚེ། ཀུ་ན་ཊྚེ། ཊ་ཀེ། ཨེ་ཌ་ཀེ། ཏ་ཏ་བེ། ཏུ་ཌ་བེ། ར་ཊ་ཀེ། ལོ་ལེ། ཧུ་ལེ། ཧི་ལི། མི་ལེ། ཏི་ལེ། ཤཱི་ལེ། ཤཱི་ལ། ཨ་ཌྷེ། བ་ཌྷེ། ན་ཌྷེ། ཀུ་ན་ཌྷེ། ཨ་ཌབ་ཏཱི།
en: Then, the Bhagavān addressed the monks: “O monks, for the benefit, welfare, and happiness of all beings, so that they may have vitality, charisma, glory, good qualities, strength, and beauty, and to protect, guard, and preserve them, I too will teach a dhāraṇī-mantra formula: aṭṭe vaṭṭe naṭṭe kunaṭṭe ṭake eḍake tatave tuḍave raṭake lole hule hili mile tile śīle śīla aḍḥe vaḍḥe naḍhe kunaḍhe aḍavatī panavatī kase kase kase phase phase phase mahāphase phase svāha.”

source: པ་ན་བ་ཏཱི། ཀ་སེ་ཀ་སེ་ཀ་སེ། ཕ་སེ་ཕ་སེ་ཕ་སེ། མ་ཧཱ་ཕ་སེ་ཕ་སེ་སྭཱ་ཧཱ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཟུང་ཤིག །
en: The Blessed One then addressed the venerable Ānanda: “Ānanda, remember this mantra formula.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་འདི་དག་སྟོན་པ་ཡང་ཤིན་ཏུ་རྙེད་པར་དཀའོ། །ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འཛིན་པ་དང་།
en: Ānanda, one who teaches this dhāraṇī-mantra formula is also exceedingly hard to find.

source: ལེན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་ནི་ཚེ་རབས་བཅུ་བཞིར་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: Ānanda, any son or daughter of noble family who remembers, receives, retains, recites, and masters this dhāraṇī-mantra formula and teaches it to others extensively will remember their last fourteen rebirths.

source: །ཚེ་འདི་ཉིད་ལ་ཡང་སྔོན་གྱི་ལས་མ་གཏོགས་པར་གཞན་གྱི་གནོད་པ་ཐམས་ཅད་ལས་འདའ་བ་དང་། འགྲོ་བ་ཐམས་ཅད་དང་རྗེས་སུ་མཐུན་པར་འགྱུར་རོ།
en: In this life they will escape all harm apart from the results of their previous actions, and they will be in harmony with all beings.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ནི་སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིས་གསུངས་ཏེ།
en: Ānanda, this dhāraṇī-mantra formula was taught by eighty-four billion buddhas.

source: གང་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ལས་འདའ་བར་བྱེད་པ་དེ་ནི་དེ་དག་ཐམས་ཅད་ལ་འཁུས་པ་ཡིན་ནོ། །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་དག་གིས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཤིང་སྐམ་པོ་གཤེར་བག་མེད་པ་ལ་བསྲུང་བ་བྱས་ཏེ། ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། བཅིང་བ་དང་།
en: This dhāraṇī-mantra formula is hidden from all those who would violate it. “

source: ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་བྱས་ན་ཤིང་དེ་ལ་ལྕུ་གུ་དང་། ལོ་མ་དག་ཀྱང་སྐྱེ་བར་འགྱུར་ཏེ། མེ་ཏོག་དང་། འབྲས་བུ་རྣམས་ཀྱང་མངོན་པར་འགྲུབ་པར་འགྱུར་ན།
en: When any son or daughter of noble family uses this dhāraṇī-mantra formula as protection for a carelessly watered, withered tree, using it to guard, support, control, pacify, and help it grow well, that tree will again produce sprouts and leaves, and it will again bear flowers and fruit.

source: མིར་གྱུར་པ་ལྟ་ཅི་སྨོས།
en: What need is there to mention what will happen for a human?

source: ནམཿསརྦ་བུདྡྷེ་བྷྱཿ། སིད་དྷ་ནྟུ་དྷཱ་ར་ཎཱི། མནྟྲ་པཱ་ད་ནི་སྭཱ་ཧཱ།
en: nāmaḥ sarvabuddhebhyaḥ siddhyantu dhāraṇīmantrapādāni svāha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་སེམས་ཅན་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་། མདངས་དང་ལྡན་པར་བྱ་བ་དང་། གཟི་བརྗིད་དང་ལྡན་པར་བྱ་བ་དང་། གྲགས་པ་དང་ལྡན་པར་བྱ་བ་དང་། ཡོན་ཏན་དང་ལྡན་པར་བྱ་བ་དང་། སྟོབས་དང་ལྡན་པར་བྱ་བ་དང་། མདོག་དང་ལྡན་པར་བྱ་བ་དང་། བསྲུང་བ་དང་། སྦ་བ་དང་། བསྐྱབ་པའི་ཕྱིར་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་གཞན་དག་ཀྱང་བཤད་པར་བྱའོ། །དེ་འདི་ལྟ་སྟེ། ཨཏྟེ། མཏྟེ། པ་ཀེ་པཱ་ར་ཀེ། པེ་ཀེ་ཌཱ།
en: The Blessed One again addressed the monks: “O monks, for the benefit, welfare, and happiness of all beings, so that they may have vitality, charisma, glory, good qualities, strength, and beauty, and to protect, guard and preserve them, I will teach another dhāraṇī-mantra formula.

source: དྲ་མ་ཏི། ཏ་ར་མ་ཏི། ཊུ་ཌ་མ་ཊི། ཊུ་ཌ་མ་ཊི། ཊུ་ཌ་ཊུ་རེ། སུ་རེ།
en: It is as follows: atte matte pake pārake vekeḍā dramati taramati ṭuḍamati ṭuḍamati ṭuḍamati ṭuḍaṭure sure hile mule tile svāha.”

source: ཧི་ལེ། མུ་ལེ། ཏི་ལེ་སྭཱ་ཧཱ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཟུང་ཤིག །
en: The Blessed One then addressed the venerable Ānanda: “Ānanda, remember this mantra formula.

source: ལོང་ཤིག །ཆོང་ཤིག །ཀློགས་ཤིག །
en: Receive it, retain it, recite it, and master it.

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འཛིན་པ་དང་། ལེན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་ནི་ཚེ་རབས་ཉི་ཤུ་རྩ་གཅིག་ཏུ་ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: Ānanda, any son or daughter of noble family who remembers, receives, retains, recites, and masters this dhāraṇī-mantra formula and teaches it to others extensively will remember their last twenty-one rebirths.

source: །གང་ལ་ལ་ཞིག་ལ་བསྲུང་བ་བྱས་ན་དེ་ལ་ཡང་འབྱུང་པོ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ།
en: Anyone who is protected by it will not be affected by any kind of bhūta.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ།
en: They will not be harmed by devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, or any humans and nonhumans.

source: །སྦྲུལ་དང་། སྲིན་བུ་དང་། སྲིན་བུ་ལུ་ཏ་དང་། སྦྲང་བུ་ལྕགས་ཕྱེ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ།
en: They will not be harmed by snakes, insects, spiders, or small biting insects.

source: །རིམས་རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། འདུས་པ་དང་། དུས་ཚིགས་འགྱུར་བ་ལས་བྱུང་བ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ། །ཞག་གཅིག་པའམ། ཞག་གཉིས་པའམ། ཞག་གསུམ་པའམ། ཞག་བཞི་པའམ། ཞག་བདུན་པའམ།
en: Fevers resulting from disorders of wind, bile, or phlegm, their combination, or a change of seasons will not affect them.

source: ཟླ་བ་ཕྱེད་པའམ། ཟླ་བ་གཅིག་པའམ། ལོ་གཅིག་པའམ། ནད་རྒྱུན་རིངས་སམ། སྐད་ཅིག་པ་རྣམས་ཀྱིས་མི་ཚུགས་སོ། །འབྲས་སམ། ཕོལ་མིག་གམ། རྐང་ཤུའམ།
en: They will not be affected by illnesses lasting one, two, three, four, or seven days, half a month, a month, or a year, or illnesses that are chronic or sudden.

source: ལྷོག་པའམ། མེ་དཔལ་ལམ། ཤུ་བའམ། ཁྱི་རྔོའམ། གཡན་པའམ། མཛེ་ཐམས་ཅད་དམ། ལྷོག་པ་ཐམས་ཅད་དམ། གཤེད་བྱེད་ཐམས་ཅད་དམ། སྒྱུར་བའི་ལས་ཐམས་ཅད་དམ། བྱད་ཐམས་ཅད་དང་། རོ་ལངས་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཚུགས་སོ།
en: Boils, lesions, eczema, blood boils, rashes, ringworm, chronic itching, scabies, all forms of leprosy, and any kind of pustule will not afflict them, and they will not be affected by kṛtya rites, or by kākhordas and vetālas. “

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ནི་སངས་རྒྱས་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུས་གསུངས་ཏེ།
en: Ānanda, this dhāraṇī-mantra formula was taught by ninety-nine billion buddhas.

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ནི་རྒྱལ་པོའི་ཕོ་བྲང་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ། །ཆོམ་རྐུན་གྱི་ནང་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ། །སྲིན་པོའི་ནང་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ། །གཅན་གཟན་ཁྲོ་བོའི་ནང་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ།
en: Ānanda, this dhāraṇī-mantra formula should be kept in mind when residing in a palace, as well as when staying among thieves, rākṣasas, and fierce predatory animals.

source: །འབྲོག་དགོན་པའི་ནང་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ། །ཀླུང་དང་བགྲོད་དཀའ་བ་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ། །མེའི་ནང་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ། །ཆུའི་ནང་ན་འདུག་ན་ཡང་ཡིད་ལ་བྱའོ།
en: It should be kept in mind when staying in the wilderness, when at a river or other place that is difficult to traverse, or when dealing with fire and water.

source: །དེ་ཡིད་ལ་བྱས་པ་དེ་རྣམས་ལས་འཇིགས་པ་དེ་དག་ཐམས་ཅད་མི་འབྱུང་ངོ་།
en: A person who keeps it in mind will not experience fear of such things.

source: །དེས་དུག་ཟོས་པ་ཐམས་ཅད་ཀྱང་ཁ་ཟས་ཉིད་དུ་འགྱུར་རོ། །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་འཛིན་པ་ནི་འབྱུང་པོ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ། །ཡི་དགས་ཐམས་ཅད་དང་།
en: It can even make poisonous food edible.

source: སྲུལ་པོ་ཐམས་ཅད་དང་། གཤེད་བྱེད་ཐམས་ཅད་དང་། སྒྱུར་བའི་ལས་ཐམས་ཅད་དང་། བྱད་ཐམས་ཅད་དང་། མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་ཏེ།
en: Ānanda, whoever upholds this dhāraṇī-mantra formula will not be harmed by any kind of bhūta, preta, pūtana, kṛtya rite, kākhorda, or human or nonhuman.

source: ཀུན་དགའ་བོ་མདོར་ན་དེ་ལ་གཞན་གྱི་གནོད་པ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ།
en: In brief, Ānanda, no harm will come to them from outside forces. “

source: །ཀུན་དགའ་བོ་གསད་པའི་རིགས་པ་ནི་ཆད་པས་བྲལ་བར་འགྱུར་རོ།
en: A person deserving of execution, Ānanda, will be freed after being struck with a rod.

source: །ཆད་པས་གཅད་པའི་རིགས་པ་ནི་བརྡེགས་པས།
en: A person deserving of being struck with a rod will be released after a beating.

source: བརྡེགས་པའི་རིགས་པ་ནི་བརྒྱད་པས།
en: A person deserving of a beating will be released after a scolding.

source: བརྒྱད་པའི་རིགས་པ་ནི་བསྡིགས་པས།
en: A person deserving of a scolding will be released with a warning.

source: བསྡིགས་པའི་རིགས་པ་ནི་མིག་ཚུགས་སུ་བལྟས་པས་ཐར་པར་འགྱུར་རོ།
en: A person deserving of a warning will be released with a stern look. “

source: །ཀུན་དགའ་བོ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་གིས་གང་ལ་བསྲུང་བ་བྱས་པའམ། ཡོངས་སུ་བསྐྱབ་པ་བྱས་པའམ། ཡོངས་སུ་གཟུང་བས་བཅིངས་པའམ། ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་བྱས་པ་གཞན་དུ་འགྱུར་བ་དེ་ནི་གནས་མེད་དེ།
en: Ānanda, a person who is controlled, calmed, and made to prosper through the protection, security, and support of these dhāraṇī-mantra formulas will never be otherwise.

source: ལྷ་དང་བཅས།
en: It is impossible.

source: བདུད་དང་བཅས། ཚངས་པ་དང་བཅས་པའི་འཇིག་རྟེན་དང་།
en: I have not seen that happen in the world of devas, māras, or Brahmā.

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་གྱི་ནང་ན་ཡང་ངས་མ་མཐོང་ངོ་།
en: I have not seen that among beings who are mendicants and brahmins, or among devas, humans, or asuras.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ནི་གནོད་པ་དང་། ནད་འགོ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་ལས་ངེས་པར་འབྱུང་བར་བྱིན་གྱིས་བརླབས་པའི་ཕྱིར་རོ།
en: This dhāraṇī-mantra formula grants blessings that bring escape from all harm, infectious diseases, and disturbances.”

source: །དེ་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྫོགས་པའི་རྗེས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱ་ཆེར་རྒྱས་པར་བགྱི་བ་དང་། ཆོས་སྨྲ་བ་དེ་དག་རྗེས་སུ་ཡོངས་སུ་གཟུང་བ་དང་། དམ་པའི་ཆོས་ཅི་ནས་ཀྱང་ཡུན་རིང་དུ་གནས་པ་དང་། བདུད་ཐམས་ཅད་ཚར་གཅོད་པའི་སླད་དུ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་གཞི་འདི་རྣམས་རྗེས་སུ་སྩལ་བར་འཚལ་ན།
en: Following this Dharma discourse, the Four Great Kings addressed the Blessed One: “Blessed One, if we also offer a dhāraṇī-mantra formula so that this Dharma discourse will spread widely, so that those who proclaim it are supported, so that the sublime Dharma will, by all means, last a long time, and so that all māras are defeated, will the Blessed One please consent to this by saying ‘Excellent’?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ལེགས་སོ་ཞེས་བགྱི་བ་གནང་བར་མཛད་དུ་གསོལ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་སྟེ།
en: Out of affection for the Four Great Kings, the Blessed One then consented with his total silence.
